<template>
  <Dialog v-model:visible="localVisible" style="height: 100%" header=" " modal>
    <article class="text-sm">
      <strong
        >ข้อตกลงระหว่างสมาชิกของบริษัทมารวยด้วยกัน จำกัด กับสมาชิก
        มีรายละเอียดดังนี้</strong
      ><br /><br />
      <p class="indent-8 text-balance">
        บริษัทมารวยด้วยกัน จำกัด ทำธุรกิจจำหน่ายสินค้าเพื่อสุขภาพ ฯลฯ
        ซึ่งต่อไปนี้จะเรียกว่า “บริษัท” สมาชิกบริษัทมารวยด้วยกัน จำกัด
        คือผู้สั่งซื้อสินค้าของทางบริษัทและสมัครเป็นสมาชิกเครือข่ายของบริษัท
        เพื่อช่วยกันจำหน่ายสินค้าหรือกระจายสินค้า และ
        สามารถสั่งซื้อสินค้าได้ในราคาที่บริษัทกำหนด
        และยังได้รับค่าตอบแทนที่ท่านแนะนำท่านอื่นมาซื้อสินค้าและเป็นสมาชิกอีกด้วย
        ซึ่งต่อไปนี้จะเรียกว่า “สมาชิก”
      </p>
      <br />
      1. ข้าพเจ้ามีอายุไม่น้อยกว่า 20 ปีบริบูรณ์ในวันที่ทำการสมัคร
      และมีเอกสารรับรองเพื่อใช้ในการสมัครสมาชิก หากข้อความดังกล่าวไม่เป็นจริง
      ข้าพเจ้ายินยอมให้ทางบริษัทฯ เพิกถอนสมาชิก และดำเนินคดีจนถึงที่สุด
      <br />
      2.
      ผู้ประกอบธุรกิจขายตรงที่จะจ่ายผลตอบแทนให้กับผู้จำหน่ายอิสระตามแผนการจ่ายผลตอบแทนที่ได้จดทะเบียนไว้ต่อนายทะเบียน
      ณ สำนักงานคณะกรรมการคุ้มครองผู้บริโภค สคบ.
      ตามที่ปรากฏในแผนการจ่ายผลตอบแทนของผู้ประกอบธุรกิจขายตรงที่มอบแก่ผู้จำหน่ายอิสระ
      <br />
      3. ผู้ประกอบธุรกิจขายตรงยินยอมที่จะรับซื้อคืนสินค้า
      วัสดุอุปกรณ์ส่งเสริมการขาย ชุดคู่มือ
      หรืออุปกรณ์ส่งเสริมธุรกิจจากผู้จำหน่ายอิสระ
      ในกรณีที่ผู้จำหน่ายอิสระประสงค์จะใช้สิทธิ์คืนสินค้าดังกล่าว
      โดยที่ผู้จำหน่ายอิสระจะต้องแสดงความจำนงใช้สิทธิ์ดังกล่าวต่อผู้ประกอบธุรกิจขายตรงภายในเวลา
      30 นับแต่วันที่ได้สินค้า
      <br />
      4. เมื่อผู้จำหน่ายอิสระใช้สิทธิ์คืนสินค้า วัสดุอุปกรณ์ส่งเสริมการขาย
      ชุดคู่มือ หรืออุปกรณ์ส่งเสริมธุรกิจ ที่ได้ซื้อไปจากผู้ประกอบธุรกิจขายตรง
      ให้ผู้ประกอบธุรกิจขายตรงซื้อคืนตามราคาที่ผู้จำหน่ายอิสระได้จ่ายไป ภายใน 15
      วัน นับตั้งแต่วันที่ผู้จำหน่ายอิสระได้ใช้สิทธิ์คืน
      แต่ในการใช้สิทธิ์ดังกล่าว กรณีที่สิ้นสุดระยะเวลาลงตามข้อ 3 ,
      ผู้ประกอบธุรกิจขายตรงมีสิทธิ์หักค่าดำเนินการต่างๆได้
      และมีสิทธิ์หักลบกลบหนี้ใดๆอันเกี่ยวกับสัญญาข้อ 1
      ที่ผู้จำหน่ายอิสระต้องชำระได้
      <br />
      5. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      การสั่งซื้อสินค้าและสมัครเป็นสมาชิกเป็นการสั่งซื้อสินค้าล่วงหน้าตามเงื่อนไขและแผนการตลาดของทางบริษัท
      และจะได้รับสินค้าจากบริษัทภายใน 60 วัน
      นับจากวันที่สั่งซื้อสินค้าและสมัครเป็นสมาชิกสินค้าที่สั่งซื้อแล้ว
      และได้มีการคิดคำนวณผลตอบแทนไปแล้วนั้น จะไม่สามารถคืนได้ไม่ว่ากรณีใดๆ
      นอกจากนี้เงินค่าสินค้าที่ผู้สั่งซื้อสินค้าตามเงื่อนไขและแผนการตลาดของบริษัทฯ
      บริษัทฯไม่สามารถคืนให้แก่ลูกค้าได้เนื่องจากตามเงื่อนไขและแผนการตลาด
      มีค่าบริหารจัดการ ค่าการตลาด ค่าภาษีอากร และค่าใช้จ่ายอื่น
      ๆซึ่งมีการคำนวณผลประโยชน์ตอบแทนหรือโบนัสให้แก่สมาชิกจากผลประกอบการและผลกำไรจากการขายสินค้า
      เป็นระบบทั้งระบบ ดังนั้น จึงไม่สามารถคืนให้แก่ลูกค้าได้
      <br />
      6.
      ข้อผู้พันอื่นๆที่ผู้ประกอบธุรกิจขายตรงสามารถกำหนดได้ให้อยู่ภายใต้กรอบของกฎหมายว่าด้วยการขายตรงและตลาดแบบตรง
      และข้อผูกพันนั้นต้องไม่ขัดต่อความสงบเรียบร้อยของศีลธรรมอันดีของประชาชน
      <br />
      7. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      การสั่งซื้อสินค้าและการเป็นสมาชิกของข้าพเจ้ามิได้มีส่วนเกี่ยวข้องกับบริษัทในฐานะผู้ถือหุ้น,
      กรรมการ, ผู้บริหาร, พนักงาน, เจ้าหน้าที่, ลูกจ้าง,หรือตัวแทนบริษัทดังนั้น
      ข้าพเจ้าไม่มีอำนาจก่อให้เกิดนิติกรรมใดๆในนามบริษัทกับผู้อื่น ฯลฯ
      <br />
      8.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าการสั่งซื้อสินค้าและสมัครเป็นสมาชิกของข้าพเจ้า
      บริษัทมิได้เป็นผู้เชิญชวนหรือชักชวน แต่ข้าพเจ้าได้รับการแนะนำต่อ
      จากผู้ที่เคยใช้สินค้ามาก่อนและมีสถานภาพการเป็นสมาชิกของ บริษัทมารวยด้วยกัน
      จำกัดเท่านั้นและมีวัตถุประสงค์ในการร่วมกันบอกต่อเพื่อจำหน่ายสินค้าและกระจายสินค้าสู่ผู้บริโภคเพื่อให้เกิดผลกำไร
      <br />
      9. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าสมาชิก
      สิ้นสุดสถานภาพการเป็นสมาชิกลงเมื่อ
      <br />
      9.1 เสียชีวิตและไม่มีทายาทผู้สืบทอดมรดกเข้ามารับโอนสถานภาพสมาชิกภายในกำหนด
      1 ปีนับตั้งแต่วันที่สมาชิกเสียชีวิต
      <br />
      9.2 ขาดการรักษาสถานะภาพสมาชิกนานติดต่อกัน90วัน
      <br />
      9.3 ถูกเพิกถอนจากการเป็นสมาชิก
      <br />
      10. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า กรณีที่สถานภาพของสมาชิก
      ได้สิ้นสุดลงด้วยการเหตุใดก็ตามสมาชิกผู้ที่สถานภาพได้สิ้นสุดลงไปแล้วนั้น
      สามารถสมัครเป็นสมาชิกภายหลังจาก 6 เดือน (180วัน)
      นับตั้งแต่วันที่สถานภาพได้สิ้นสุดลง
      <br />
      11. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า กรณีที่สมาชิก
      ไม่อาจดำเนินการโอนสถานภาพการเป็นสมาชิกด้วยตนเองเพราะเหตุใดเหตุหนึ่งตามที่ระบุไว้ดังต่อไปนี้บริษัทจะโอนสถานภาพการเป็นสมาชิกให้แก่ผู้สืบทอดมรดกตามที่ระบุไว้ในใบสมัคร
      <br />
      11.1 กรณีสมาชิกเสียชีวิต
      <br />
      11.2 เมื่อแพทย์ลงความเห็นว่าวิกลจริต
      <br />
      11.3 เมื่อศาลมีคำสั่งให้เป็นคนไร้ความสามารถหรือเสมือนไร้ความสามารถ
      <br />
      12. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      ผู้สั่งซื้อสินค้าและสมาชิกผู้ร่วมธุรกิจอิสระ
      ต้องปฏิบัติตนให้เหมาะสมกับการมีอาชีพต่อไปนี้
      <br />
      12.1 ให้บริการที่ดีอย่างสม่ำเสมอ
      <br />
      12.2 มีความซื่อสัตย์ สุจริต จริงใจต่อลูกค้า
      บริษัทและเพื่อนร่วมอาชีพโดยจะไม่แย่งสายงานจากเพื่อนร่วมอาชีพ
      ไม่ทำให้ลูกค้าบริษัทฯ
      และเพื่อนร่วมอาชีพสูญเสียผลประโยชน์หากสมาชิกประพฤติผิดเกี่ยวกับการแย่งสายงาน
      หรือลูกค้า ทางบริษัทจะตัดหรือเพิกถอนการเป็นสมาชิกออกจากบริษัททันที
      โดยไม่ต้องจ่ายเงินคืนหรือผลประโยชน์ใดๆ ให้แก่สมาชิกที่ประพฤติผิดนั้น
      <br />
      12.3 ไม่ลดหรือเสนอที่จะลดผลประโยชน์เพื่อจูงใจลูกค้า
      <br />
      12.4
      ไม่กล่าวเปรียบเทียบให้ร้ายหรือพูดลบที่อาจก่อให้เกิดความเสียหายต่อบริษัทฯ
      ผู้บริหารและเพื่อนร่วมอาชีพอย่างไม่ยุติธรรมทางตรงและทางอ้อม
      <br />
      12.5
      หมั่นศึกษาหาความรู้ในวิชาชีพเพื่อเพิ่มเติมอย่างสม่ำเสมอหมั่นเข้าฝึกอบรมหรือเข้าประชุมตามที่ทางบริษัทจัดขึ้นทุกครั้ง
      <br />
      12.6 พัฒนาบุคลิก การแต่งกาย ตรงต่อเวลานัด ให้ความร่วมมือในกิจกรรมกับบริษัท
      เป็นอย่างดี
      <br />
      12.7 ประพฤติตนอยู่ในศีลธรรม ประเพณีอันดีงาม ทั้งดำรงไว้ซึ่งเกียรติ
      และศักดิ์ศรีแห่งคุณธรรม
      <br />
      13.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าบริษัทตกลงที่จะจ่ายผลตอบแทนให้กับผู้สั่งซื้อสินค้าและสมาชิกตามผลประกอบการและแผนการตลาดหรือจากผลกำไรจากการจำหน่ายสินค้าของบริษัท
      <br />
      14. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่านอกเหนือจากแผนงานหรือนโยบายของบริษัท
      และมิได้เกิดจากความยินยอมหรือรับรองจากบริษัทหรือการกระทำใดๆ
      ที่กล่าวอ้างบริษัท
      โดยก่อให้เกิดความเสียหายถือเป็นความรับผิดชอบเฉพาะตัวของข้าพเจ้าแต่เพียงผู้เดียวไม่เกี่ยวข้องกับบริษัท
      บริษัทจะไม่รับผิดชอบใดๆ และข้าพเจ้ายินยอมรับผิดชอบเป็นส่วนตัวในทางกฎหมาย
      ทั้งในทางแพ่งและทางอาญา
      <br />
      15. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      ข้าพเจ้าจะช่วยบริษัทจำหน่ายสินค้าโดยการบอกต่อ
      และจะดูแลให้บริการลูกค้าที่ข้าพเจ้าแนะนำด้วยค่าใช้จ่ายของข้าพเจ้าเอง
      <br />
      16.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าทางบริษัทห้ามสมาชิกทอดทิ้งลูกค้าและสายงานโดยจะต้องให้บริการที่ดีและมีความสม่ำเสมอแก่ลูกค้าเมื่อลูกค้าสมัครเข้าเป็นสมาชิก
      ในสายงานของตนก็ต้องให้คำแนะนำถึงวิธีดำเนินธุรกิจ ของบริษัทมารวยด้วยกัน
      จำกัด ที่ถูกต้องโดยให้ช่วยกันขายสินค้า ของบริษัท บอกต่อคุณภาพของสินค้า
      ของบริษัทให้กำลังใจ ให้ข้อมูลและ แนะนำเข้าสู่แผนงานการฝึกอบรมต่างๆ
      ตามที่บริษัทได้จัดเสนอให้อย่างถูกต้องสม่ำเสมอ
      <br />
      17. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าสมาชิกไม่มีสิทธิเรียกร้อง เงินเดือน,
      สวัสดิการ, เงินช่วยเหลือและ/หรือ รายได้อื่นใดจากบริษัท ยกเว้นรายได้,
      ผลตอบแทนและสวัสดิการเฉพาะส่วนที่สมาชิกพึงได้รับจากผลประกอบการหรือผลกำไรจากการขายสินค้า
      ของบริษัท ตามที่ระบุไว้ในแผนงานของบริษัท
      <br />
      18. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      หากสมาชิกกระทำการใดๆที่ก่อให้เกิดหนี้สินกับบริษัทไม่ว่าด้วยเหตุใด
      และจำนวนเงินเท่าใดบริษัทมีสิทธินำเอาผลประโยชน์ของสมาชิกมาหักหนี้นั้นๆได้
      <br />
      19.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าจะไม่ยอมรับรูปแบบการทุจริตใดๆที่มาจากบุคคลอื่นในการที่จะสนับสนุนการหาสมาชิกใหม่หรือยืนยันรับสิทธิ์ของทางบริษัทที่จะส่งผลต่อสถานภาพการเป็นผู้จำหน่ายสินค้า
      ของบริษัท ของข้าพเจ้าไม่ว่าจะเป็นในลักษณะใดก็ตาม
      <br />
      20. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      การติดต่อกับหน่วยงานราชการใดหรือองค์กรเอกชนใดเพื่อเป็นการดำเนินธุรกิจจะต้องได้รับอนุมัติจากบริษัทเป็นลายลักษณ์อักษร
      <br />
      21. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ผลิตภัณฑ์ ของบริษัท
      อุปกรณ์ส่งเสริมการขาย สื่อสิ่งพิมพ์เครื่องหมายการค้า ชื่อ
      และอุปกรณ์ต่างๆที่เป็นกรรมสิทธิ์ของบริษัทฯ ห้ามมิให้นำไปใช้
      ลอกเลียนแบบหรือทำซ้ำ หรือดัดแปลง เพื่อการใดๆทั้งสิ้น
      <br />
      22. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ห้ามสมาชิกใช้สิทธิใดๆ
      เหนือเครื่องหมายการค้า เครื่องหมายบริการ โลโก้ รูปรอยประดิษฐ์
      รวมตลอดถึงทรัพย์สินทางปัญญาทั้งหลายทั้งปวงของบริษัทหากไม่ได้รับความยินยอมเป็นหนังสือจากกรรมการหรือตัวแทนผู้มีอำนาจของบริษัทฯ
      <br />
      23. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า จะนำเสนอผลิตภัณฑ์ ของบริษัท
      แผนงานการดำเนินธุรกิจและการฝึกอบรมต่างๆ โดยจะไม่โฆษณาชักชวน
      โดยกล่าวคำอวดอ้างหรือคำยืนยันที่ไม่เป็นจริงนอกเหนือจากที่บริษัทได้ประกาศรับรองไว้ในเอกสารหรือแผนงานของบริษัท
      <br />
      24.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าห้ามสมาชิกบังคับซื้อสินค้าตลอดจนถึงการกักตุนสินค้าหรือบังคับเกินความจำเป็นในการใช้สินค้าหรือการขยายธุรกิจ
      <br />
      25. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ห้ามสมาชิกจำหน่าย หรือ
      จัดวางสินค้าของบริษัทฯ ในสถานที่ใด ๆ เช่นขายปลีกร้านค้าสหกรณ์
      ตลาดขนาดเล็กซุปเปอร์มาร์เก็ต ห้างสรรพสินค้า หรือสถานที่อื่น หรือ
      โฆษณาเพื่อเสนอขายสินค้าดังกล่าวทางสื่อใดๆโดยไม่ได้รับอนุมัติจากบริษัทเป็นลายลักษณ์อักษร
      โดยเด็ดขาดเพื่อไม่ก่อให้เกิดการได้เปรียบเหนือสมาชิกอื่นๆ
      <br />
      26. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ห้ามสมาชิก จำหน่ายหรือเสนอผลิตภัณฑ์
      ของบริษัท แก่สายงานอื่น
      รวมทั้งห้ามชักชวนให้สมาชิกผู้อื่นเปลี่ยนสายงานโดยเด็ดขาดเพื่อไม่ให้เกิดความสับสน
      แตกความสามัคคี
      และส่งผลกระทบต่อการบริหารจัดการการตลาดของสมาชิกในสายงานอื่นๆ
      <br />
      27. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      จะทำความเข้าใจที่ถูกต้องเกี่ยวกับบริษัท
      ไม่บิดเบือนข้อมูลอวดอ้างหรือนำเสนอข้อมูลที่อาจก่อให้เกิดความเข้าใจผิดเกี่ยวกับการดำเนินงาน
      ผลิตภัณฑ์หรือระบบตอบแทนของบริษัท
      โดยจะต้องให้ข้อเท็จจริงแก่ลูกค้าอย่างชัดเจนว่า ธุรกิจ บริษัทมารวยด้วยกัน
      จำกัด จำกัด คือโอกาสที่จะสร้างผลงานการขายสินค้า ของบริษัท
      ที่นำมาซึ่งรายได้จากระบบแผนการตลาด โดนคิดคำนวณจากยอดซื้อ
      ยอดขายทั้งส่วนตัวและทีมงานมิใช่นำมาจากยอดการหาจำนวนคนเข้าสู่เครือข่ายสายงาน
      <br />
      28. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า จะไม่จำหน่ายผลิตภัณฑ์ของบริษัท
      ของบริษัทต่ำกว่าราคาสมาชิก และสมาชิกบริษัทไม่มีสิทธิเป็นผู้กำกับดูแล
      กำหนดราคานอกเหนือจากราคาของบริษัท
      เพื่อให้สอดคล้องกับความต้องการของตลาดเพื่อให้เกิดประโยชน์สูงสุดแก่สมาชิกอื่น
      <br />
      29.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าห้ามสมาชิกจำหน่ายหรือเสนอบริการอื่นที่ไม่ใช่ผลิตภัณฑ์ของบริษัทอันเป็นคู่แข่งของสินค้าของบริษัทโดยเด็ดขาด
      <br />
      30. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า
      หากเกิดกรณีพิพาทขึ้นระหว่างสมาชิกกับสมาชิก หรือสมาชิกกับลูกค้า
      หรือสมาชิกกับบริษัท ก็ตามให้ยึดเอาคำตัดสินของกรรมการบริษัท เป็นที่สุด
      <br />
      31. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าหากมีกรณีที่ รายได้
      และ/หรือผลตอบแทนใดๆที่บริษัทจ่ายให้เกินจากสิทธิที่ข้าพเจ้าพึงได้รับข้าพเจ้าจะต้องคืนให้บริษัททันทีที่ข้าพเจ้าทราบหรือได้รับแจ้งจากบริษัทโดยชำระคืนเป็นเงินสดหรือยินยอมให้บริษัทหักจากรายได้ตามที่ได้เกินมา
      <br />
      32. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ข้าพเจ้าขอมอบอำนาจให้บริษัทเก็บ
      และถ่ายทอดข้อมูล(ส่วนตัวข้าพเจ้า, ข้อมูลเกี่ยวกับลูกค้า,
      ข้อมูลเกี่ยวกับการดำเนินธุรกิจขายตรงและข้อมูลอื่นๆที่เกี่ยวข้องทั้งหมด)
      ได้โดยวิธีการทางอิเล็กทรอนิกส์
      <br />
      33. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า ข้าพเจ้าเต็มใจที่จะยอมรับกฎระเบียบ
      ข้อบังคับต่างๆและจะปฏิบัติตามกฎหมาย
      ซึ่งรวมถึงพระราชบัญญัติการขายตรงและตลาดแบบขายตรงพ.ศ.2545ทั้งหมดด้วย
      <br />
      34. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าการกระทำของสมาชิก
      อันจะนำไปสู่มาตรการลงโทษ มีดังนี้
      <br />
      34.1 สมาชิกฝ่าฝืนกฎระเบียบข้อบังคับ จรรยาบรรณของบริษัท
      <br />
      34.2 สมาชิกได้กระทำการอันเป็นการเสื่อมเสียต่อบริษัท และผลิตภัณฑ์ของบริษัท
      <br />
      34.3 สมาชิก กระทำการอันเป็นเหตุให้บริษัท เสียหายในการประกอบกิจการ
      <br />
      34.4 สมาชิก ได้แจ้งหรือแสดงข้อมูลเกี่ยวกับสมาชิก
      หรือข้อมูลเกี่ยวกับบริษัทไม่ตรงกับข้อเท็จจริง
      <br />
      35. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่ามาตรการ
      การลงโทษของบริษัทเรียงลำดับตามความรุนแรงของการกระทำดังต่อไปนี้
      <br />
      35.1 ตักเตือนเป็นลายลักษณ์อักษร
      <br />
      35.2 งดรับสิทธิประโยชน์ต่างๆ อันพึงจะได้ในรอบการจ่ายนั้นๆ
      <br />
      35.3 เพิกถอนสถานภาพออกจากการเป็นสมาชิก
      <br />
      36. ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่า หากข้าพเจ้าประพฤติผิดไปจากเงื่อนไข,
      ข้อตกลง ตลอดจนแผนงานและกติกาที่บริษัทกำหนด รวมถึงจรรยาบรรณ
      กฎและระเบียบของกฎหมายขายตรงบริษัทมีสิทธิในการพิจารณาบอกเลิกการเป็นสมาชิก
      รวมถึงการตัด, ลด,งด,ระงับและหรือยกเลิกการจ่ายผลประโยชน์ของข้าพเจ้า
      ทั้งในส่วนที่เกิดขึ้นและจะเกิดขึ้นต่อไปในอนาคตโดยข้าพเจ้าไม่มีสิทธิเรียกร้องใดๆ
      จากบริษัททั้งสิ้น
      <br />
      37.
      ข้าพเจ้าตกลงยินยอมและเข้าใจดีว่าบริษัทสงวนสิทธิในการพิจารณาเปลี่ยนแปลง,
      แก้ไข และปรับปรุงเงื่อนไข หรือข้อกำหนดต่างๆ ตามที่บริษัทเห็นสมควร
      โดยไม่ต้องแจ้งให้ทราบล่วงหน้าทั้งนี้บริษัทจะทำการแจ้งเป็นลายลักษณ์อักษรให้ทราบภายหลัง
      <br />
      38. ข้าพเจ้าได้อ่านและเข้าใจข้อความทั้งหมดแล้วและยอมรับเงื่อนไขต่าง ๆ
      ตามที่บริษัทกำหนดทุกประการด้วยความสมัครใจของข้าพเจ้าเอง
      <br /><br />
      <strong class="text-sm"
        >***หากสมาชิกท่านใดที่มีอายุน้อยกว่า 20
        ปีต้องมีเอกสารรับรองจากทางผู้ปกครองเพื่อใช้ในการสมัครสมาชิก
        มิฉะนั้นหากทางบริษัททราบภายหลังรหัสดังกล่าวจะถือว่าเป็นโมฆะทันที</strong
      >
    </article>
    <div class="my-3 border-t pt-3 flex">
      <input
        id="agree"
        type="checkbox"
        class="border border-gray-300 p-3 focus:ring-1 rounded"
        v-model="agree"
      />
      <label class="text-sm ml-2" for="agree"
        >ฉันได้อ่านและยอมรับเงื่อนไขข้อกำหนดดังกล่าว</label
      >
    </div>
    <button
      @click="handleSendRegister"
      :disabled="!agree"
      class="w-full mb-5 text-center py-1 rounded"
      :class="agree ? 'bg-purple-500 text-white' : 'bg-gray-300'"
    >
      ยอมรับข้อตกลง และสมัครสมาชิก
    </button>
  </Dialog>
</template>

<script setup>
import { ref, watch } from "vue";
const agree = ref(false);
const props = defineProps({
  visible: Boolean,
});

const emits = defineEmits(["sendRegister", "update:visible"]);

const handleSendRegister = () => {
    emits("sendRegister");
}

const localVisible = ref(props.visible);

watch(
  localVisible,
  (newValue) => {
    emits("update:visible", newValue);
  }
);

watch(
  () => props.visible,
  (newValue) => {
    localVisible.value = newValue;
  }
);
</script>
